Update for Release v1.3.6
